TEXT_GREETING = """Привет! 👋
Я — бот для мониторинга дедлайнов на ПМИ ВШЭ.

📌 Я слежу за сообщениями в каналах дисциплин и автоматически сообщаю, когда появляется новый дедлайн или обновляется старый.
🗓 Также ты можешь в любой момент посмотреть список всех актуальных дедлайнов.

Выбери действие с помощью кнопок ниже"""

TEXT_NO_UPCOMING_DEADLINES = "Нет предстоящих дедлайнов 🤩"

BTN_UPCOMING_DEADLINES = "📅 Предстоящие дедлайны"
BTN_MY_SUBSCRIPTIONS = "📝 Мои подписки"
BTN_ADMIN_PANEL = "🔧 Админ-панель"

BTN_ADMIN_STATS = "📊 Статистика"
BTN_ADMIN_USERS = "👥 Управление пользователями"
BTN_ADMIN_GROUPS = "📚 Управление группами"
BTN_ADMIN_EXIT = "🏠 Выйти из админ-панели"

BTN_ADD_GROUP = "➕ Добавить группу"
